[
    {
        "type": "block",
        "title": "Resumen",
        "components": [
            {
                "type":"text",
                "text": "Según el DSM IV, el trastorno de ansiedad generalizada puede definirse como preocupación excesiva, ansiedad y expectación aprehensiva sobre una amplia gama de acontecimientos, que se prolonga más de seis meses. En este trastorno se presenta sintomatología tanto cognitiva y fisiológica como motora. La persona puede experimentar tensión muscular, fatiga, irritabilidad, alteraciones del sueño, palpitaciones, así como conductas de evitación. También presenta distorsiones cognitivas referidas a una sobrevaloración de la probabilidad de que ocurra un suceso temido, o sobre su severidad, así como infravaloración de sus recursos de afrontamiento y de la posibilidad de recibir ayuda de otros. A continuación se presenta un caso clínico de una paciente diagnosticada con un trastorno de ansiedad generalizada donde se ha utilizado para el tratamiento un paquete de técnicas cognitivoconductuales. Los instrumentos utilizados para la evaluación del caso fueron el Inventario de Situaciones y Respuestas de Ansiedad –ISRA- (Miguel-Tobal y Cano Vindel, 1994), el Inventario de depresión de Beck –BDI- (versión adaptada y validada en población española por Sanz y Vázquez, 1997, Vázquez y Sanz, 1997a, b), el Inventario de Solución y Afrontamiento de problemas –ISAP- (Miguel-Tobal, J y Casado Morales, M.I., 1992) y el Inventario de Temores de Wolpe (FSSIII) (Wolpe 1969). De igual forma, se diagnosticó el Trastorno de Ansiedad Generalizada a través de los criterios del DSM IV. El proceso terapéutico estuvo constituido por 12 sesiones: tres de evaluación pre-tratamiento, ocho de intervención y una de seguimiento y evaluación final. Durante la intervención se utilizaron técnicas como la reestructuración cognitiva, parada de pensamiento, entrenamiento en habilidades sociales, exposición, y relajación progresiva de Jacobson. Los resultados obtenidos indican que hubo cambios positivos después de la intervención, reflejados en los instrumentos de evaluación y verbalmente por la propia paciente. Particularmente se produjeron cambios en la modificación de pensamientos distorsionados, la disminución de la sintomatología fisiológica y en la adquisición de habilidades que le permitieron a la paciente afrontar con mayor éxito las situaciones de la vida cotidiana que le causaban síntomas de ansiedad."
            }
        ]
    },{
        "type": "block",
        "title": "Abstract",
        "components": [
            {
                "type":"text",
                "text": "According to DSM-IV, the generalized anxiety disorder is defined as an excessive expectation and apprehension about a wide range of events; this concern lasts longer than six months. Cognitive, physiological and motor symptoms are evidenced. The patient experiences muscular tension, fatigue, irritability, sleep disorders, heart beating, and avoidance behaviour. Also cognitive distortions, overrating the probability of the feared event or its severity, as well as underestimation of the individual’s coping strategies and the possibility of getting help form other people. In the clinical case presented here, a patient suffering generalized anxiety disorder has been treated with a set of cognitive-behavioural technique. The instruments used to evaluate the case were the Inventory of Situations and Responses of Anxiety –ISRA-(Miguel-Tobal y Cano-Vindel, 1994), Beck’s Depression Inventory –BDI- (adapted and validate for Spanish population by Sanz and Vázquez, 1997; Vázquez and Sanz, 1997a, 1997b), Solving and Coping’s Problem Inventory (Miguel-Tobal and Casado-Morales, 1992) and the Wolpe’s Fear Survey –FSSIII- (Wolpe, 1969). The DSM-IV criteria were used to diagnose the General anxiety Disorder. The therapeutical process included 12 sessions: three for pre-treatment assessment, eight for intervention and one for follow up. During the intervention techniques such as cognitive restructuring, stop thinking strategies, social skills training, exposure and progressive relaxation were used. The results obtained indicate that there were positive changes followed the intervention, reflected in the assessment instruments and expressed verbally by the patient. Specifically, changes were produced in the modification of distorted thoughts, the physiological symptoms were reduced and social abilities were acquired by the patient, allowing her to face more successfully ordinary life situations which used to cause her apprehension."
            }
        ]
    },{
        "type": "block",
        "title": "Introducción",
        "components": [
            {
                "type":"text",
                "text": "La ansiedad puede definirse como una respuesta emocional, que engloba tanto aspectos cognitivos desagradables (tensión y aprehensión), como aspectos fisiológicos (alto grado de activación del SNA), y motores, que suelen implicar conductas de carácter desadaptativo. La respuesta de ansiedad puede ser producida por estímulos externos o situacionales, o por estímulos internos al sujeto (pensamientos, ideas, imágenes, etc.), que son percibidos por el individuo como peligrosos y amenazantes. El tipo de estimulo capaz de evocar la respuesta de ansiedad vendrá determinado en gran medida por las características del sujeto (Miguel-Tobal, 1990). El límite entre la ansiedad normal y patológica viene determinado por la intensidad y duración de la respuesta y por la cantidad de estímulos que son capaces de evocar en nosotros dicha respuesta. Entre los diferentes trastornos de ansiedad que han sido descritos, nos encontramos con el trastorno de ansiedad generalizada, que según el DSM-V (1998), se caracteriza por una preocupación excesiva, ansiedad y expectación aprehensiva sobre una amplia gama de acontecimientos o actividades como el rendimiento laboral o escolar, que se prolonga más de 6 meses. Dicho estado es difícil de controlar por la persona que lo padece y se asocia a tres o más de los siguientes síntomas: inquietud o impaciencia, fatigabilidad fácil, dificultad para concentrarse o tener la mente en blanco, irritabilidad,  tensión muscular, alteraciones del sueño (dificultades para concentrarse o mantener el sueño o sensación al despertarse de sueño no reparador). Los pacientes ansiosos tienen una serie de distorsiones cognitivas en las que tienden a interpretar mayor cantidad de situaciones como peligrosas (pérdida, daño, enfermedad o muerte), y suelen cometer cuatro tipo de errores: - Sobreestimación de la probabilidad de un suceso temido. - Sobreestimación de la severidad de un suceso temido. - Infraestimación de los recursos de afrontamiento. - Infraestimación de las posibilidades de ayuda de otros. Particularmente en la ansiedad generalizada, Beck (cit. por Cano, 2000) distingue cinco categorías de distorsiones cognitivas: miedo al daño físico, miedo a la enfermedad mental, a la pérdida de control; miedo al fracaso y a la incapacidad para afrontar las situaciones, así como miedo a ser rechazado o despreciado. Son personas que tienen dudas sobre su autovalía y competencia, que tienden a preocuparse excesivamente por todo. Se han utilizado diversas técnicas para tratar el trastorno de ansiedad generalizada. Debido al carácter multidimensional de la respuesta de ansiedad, suelen emplearse combinaciones de técnicas dirigidas a incidir sobre los aspectos tanto fisiológicos como cognitivos y conductuales. En este sentido, se podría decir que existen tres tipos de técnicas de reducción de ansiedad: - Técnicas dirigidas a la reducción del nivel de activación: como las técnicas de relajación y respiración y las técnicas de biofeedback. - Técnicas de exposición: constituidas por un conjunto de procedimientos dirigidos a exponer al paciente, de forma imaginaria o real, a estímulos y situaciones que le producen ansiedad. En esta categoría se incluyen la desensibilización sistemática, las distintas formas de exposición y el modelado. - Técnicas cognitivas: abarcan un conjunto de técnicas cuyo objetivo es lograr un cambio de conducta a través de la modificación de las cogniciones. Aquí se encuentran la terapia cognitiva de Beck y la inoculación al estrés (Miguel-Tobal y Casado, 1999). Las técnicas cognitivo-conductuales estarían constituidas por los dos últimos grupos y han resultado ser de gran utilidad en el tratamiento de la ansiedad, debido a que, al mismo tiempo, se logran modificar distorsiones cognitivas productoras de estímulos ansiógenos e instruir al paciente en técnicas que le permiten enfrentarse mejor a situaciones reales de estrés que le lo cual le proporciona mayor seguridad en sí mismo y que por lo tanto disminuyen sus respuestas de ansiedad. En este caso, las técnicas ayudan a disminuir la intensidad y duración de las respuestas de ansiedad y a valorar las situaciones de una forma más adecuada y realista."
            }
        ]
    }
]