[
    {
        "type": "block",
        "title": "Neoplasia",
        "components": [
            {
                "type":"text",
                "text": "Definición: Neoplasia significa crecimiento nuevo. La neoplasia es una masa anormal de tejido, con un crecimiento excesivo y descoordinado que persiste de forma exagerada cuando cesan los estímulos que indujeron dicho cambio. La neoplasia se puede definir como una alteración del crecimiento celular desencadenada por una serie de mutaciones adquiridas que afectan a una sola célula y a su progiene clonica. Todos los tumores presentan dos componentes esenciales:  Células Neoplasicas: que constituyen el parenquima tumoral. Estroma Reactivo: Compuesto por tejido conectivo, vasos sanguíneos y células del sistema inmunitario innato y adaptativo."
            },{
                "type":"text",
                "text": "La clasificación de los tumores y de su comportamiento biológico se basa, en el componente parénquimantoso, pero su velocidad de crecimiento y propagación dependen del estroma. El tejido conectivo de algunos tumores es escaso, por lo que la neoplasia tiene una consistencia blanda y carnosa. En cambio, en otras ocaciones, las células parénquimantosas estimulan la formación de un estroma colágeno abundante, denominado desmoplásia. Los tumores pueden ser diferenciados entre sí y clasificados acorde a: 1. DIFERENCIACIÓN CELULAR 2. VELOCIDAD DE CRECIMIENTO 3. INVASIÓN LOCAL 4. METÁSTASIS"
            },{
                "type":"block",
                "title": "Tumores Benignos",
                "components": [
                    {
                        "type": "text",
                        "text": "Se dice que un tumor es benigno, cuando su aspecto macroscópico y microscópico parece relativamente inocente, es decir, se queda localizado, sin propagarse hacia otros lugares y es susceptible de extirpación quirúrgica local. Los tumores benignos tienen una mayor posibilidad de conservar las funciones de las células originarias, mientras que a diferencia de los malignos, estos adquiren en ocasiones, funciones imprevistas debido a alteraciones en su diferenciación.  Los tumores benignos crecen despacio a diferencia de los malignos que suelen ser más rápidos. Además, los tumores benignos están circunscriptos en una cápsula mientras que los malignos están mal delimitados e invaden los tejidos sanos circulantes. Por otro lado, al ser benigno permanece localizado en su lugar de origen, mientras que los malignos tienen la capacidad de metastatizar a distancia. Los tumores benignos se designan agregando el sufijo -oma (fibroso → fibroma; cartilaginoso → condroma). Los tumores epiteliales glandulares benignos se conocen como adenomas. Cualquier neoplasia epitelial benigna que emita proyecciones digitales o verrugas sobre la superficie cutánea se conoce como papiloma. Las grandes masas quísticas se conocen como cistoadenomas, y si dicho quiste tiene un papiloma en su luz se habla de un cistoadenoma papilar."
                    }
                ]
            },{
                "type":"block",
                "title": "Tumores Malignos",
                "components": [
                    {
                        "type": "text",
                        "text": "cáncer (latín: cangrejo, por su forma de adhesión al tejido). Los tumores malignos pueden invadir y destruir las estructuras adyacentes, y propagarse hacia sitios remotos es decir metastatizar, causando la muerte. Los tumores malignos suelen crecer más rápidamente que los benignos."                            
                    },{
                        "type": "list",
                        "list": [
                            "Los cánceres originados a partir de tejido mesenquimatosos sólidos son nombrados agregándole el sufijo -sarcoma. ",
                            "Si son derivados de las células hematopoyéticas, se habla de leucemias o linfomas según el linaje celular.",
                            "Si el cáncer es originado a partir de células epiteliales, de cualquiera de las tres capas, se lo conoce como carcinoma. Si el epitelio es escamoso: carcinoma escamoso. Si es glandular: adenocarcinoma. Si es de transición: carcinoma transicional.",
                            "Esta división tajante tiene sus excepciones, como por ejemplo los tumores malignos de piel llamados melanomas con su forma benigna que recibe el nombre de nevus."
                        ]
                    }
                ]
            },{
                "type":"block",
                "title": "Tumores Mixtos",
                "components": [
                    {
                        "type": "text",
                        "text": "También llamados tumores bifenotípicos dado que, si bien derivan de un único clon neoplásico, éste diverge en dos tipos celulares diferentes por lo que el tumor termina teniendo dos tejidos diferentes mezclados entre sí."
                    },{
                        "type": "list",
                        "list": [
                            "PÓLIPO: (término descriptivo) proyección macroscópica y visible hacia la luz de un órgano hueco. Esta proyección puede ser plana o con un tallo, y puede tener origen neoplásico, inflamatorio, hiperplásico o hamartomatoso. Si el pólipo contiene tejido glandular, se habla de pólipo adenomatoso.",
                            "HAMARTOMA: masas benignas de tejido maduro y bien diferenciado propias del tejido circundante (histológicamente normales) pero con disposición desorganizada.",
                            "CORISTOMA: o resto heterotópico, se trata de una masa de tejido maduro y normal en un lugar que no le corresponde. No es neoplásico, sino que se debe a formaciones embriológicas desplazadas.",
                            "BLASTOMA: son tumores malignos, agresivos, muy inmaduros y primitivos. El término primitivo hace referencia a que remontan a tejidos embriológicos (las células intentan imitar tejidos embrionarios), dado que se han activado programas genéticos con genes embrionarios (hasta entonces dormidos) que producen un retroceso del tipo celular. Primitivo e inmaduro no es lo mismo que anaplásico e indiferenciado.",
                            "TERATOMA: formaciones neoplásicas que nacen de células totipotenciales gonadales que generan derivados de las tres capas germinativas embrionarias. Pueden ser benignos o malignos. Su malignización puede estar dada por dos cosas: Uno de sus componentes tisulares maduros se vuelve maligno. El teratoma comienza a fabricar tejidos inmaduros y embrionarios. Al extraerlo, debe buscarse la malignización o la inmadurez de un tejido. Un teratoma sumamente bien diferenciado puede asemejarse a un humano: homúnculo.",
                            "DISPLASIA: es un crecimiento neoplásico desordenado del epitelio, caracterizado por una alta atipia celular (↑ pleomorfismo, ↑ polaridad mitótica, alteraciones en la morfología nuclear, pérdida de la polaridad celular del tejido). Esta displasia puede afectar la parte basal del epitelio (displasia de bajo grado), los dos tercios del espesor del epitelio (displasia moderada) o el espesor completo del epitelio (carcinoma in situ o displasia de alto grado). El carcinoma in situ se caracteriza por quedar confinado en el epitelio, es decir no atraviesa la membrana basal, es una neoplasia intra-epitelial. Una vez que el carcinoma atraviesa la membrana basal, se vuelve un carcinoma infiltrante. De esto se desprende que todo carcinoma tiene su origen en una displasia o carcinoma in situ."
                        ]
                    }
                ]
            },{
                "type":"block",
                "title": "Diferenciación y Anaplasia",
                "components": [
                    {
                        "type": "text",
                        "text": "Es la magnitud en que las células parenquimatosas neoplásicas se asemejan en su función y forma a las células del parénquima sano del que toman origen. Cuanto mayor es el grado de diferenciación, mayor similitud morfológica hay entre la masa neoplásica y el tejido sano, por lo que es más difícil distinguirlos. Así mismo, un mayor grado de diferenciación implica una mayor similitud fisiológica entre el tejido normal y la masa neoplásica, que puede llegar a secretar las mismas hormonas que el tejido original o adquirir funciones nuevas o imprevistas en caso de una anaplasia. Según su grado de diferenciación, se los puede clasificar en:"
                    },{
                        "type": "list",
                        "list": [
                            "Bien Diferenciados",
                            "Moderadamente Diferenciados",
                            "Pobremente Diferenciados",
                            "Falta de Diferenciación: ANAPLASIA"
                        ]
                    }
                ]
            }
        ]
    }
]