[
    {
        "type": "block",
        "title": "Introducción y conceptos claves",
        "components": [
            {
                "type": "text",
                "text": "En este documento se encuentra una breve explicación de los puntos más importantes del formato desarrollado. El mismo toma el nombre de '.book' al menos por el momento, tan solo para poder tener un sujeto en los próximos renglones.<br/>Cabe aclarar que el mismo se encuentra en etapas tempranas de desarrollo y debe entenderse más como un concepto que como un producto final."
            },
            {
                "type": "block",
                "title": "Bloques",
                "components": [
                    {
                        "type": "text",
                        "text": "Como unidad de construcción, el formato hace uso del concepto de 'bloques' los cuales tienen un título y una serie de componentes, a su vez cada uno de estos componentes puede ser un bloque de texto, una lista, una imagen, o un video. (objetos 3D y paquetes SCORM están en la lista de espera)."
                    },{
                        "type": "text",
                        "text": "Esta idea de bloques nos permitirá estructurar la interacción con el estudiante, ofreciendo conceptos simples y ordenados que den más poder al lector para manejar su aprendizaje"
                    },{
                        "type": "text",
                        "text": "Otra punto importante de la organización en bloques, es el poder resolver consultas buscando palabras no solo en el texto, si no en el contexto de un bloque. Si bien una palabra puede encontrarse en diferentes lugares, podemos calcular la importancia de una palabra en un bloque, y de esa manera orientar la búsqueda de una manera mucho más inteligente. Ofreciendo contexto al estudiante a la hora de consultar por información."
                    }
                ]
            },
            {
                "type": "block",
                "title": "Recursividad",
                "components": [
                    {
                        "type": "text",
                        "text": "Además de los componentes nombrados más arriba, la lista de componentes de un bloque puede estar conformada por otros bloques, de hecho, este bloque de texto es un componente del bloque 'Recursividad', que a su vez es un componente del bloque 'Introducción y conceptos claves'. Esto mismo nos da la posibilidad de entender la interacción documentada como un arbol de bloques que se relacionan entre sí para crear el objeto de aprendizaje final. Esto nuevamente nos ayudará más adelante cuando avancemos en nuestro sistema de búsqueda."
                    },{
                        "type": "text",
                        "text": "Si bien esto nos permite expresar la idea de capítulos y subcapítulos, o secciones y subsecciones; me parece interesante liberarse de los limites del libro convencional, y entender al documento más bien como un conjunto de modulos, que si bien las diferencias pueden ser poco claras, nos da un punto de partida separado al del libro invitándonos a una forma de pensar diferente."
                    }
                ]
            },{
                "type": "block",
                "title": "Accesibilidad",
                "components": [
                    {
                        "type": "text",
                        "text": "Frente a las grandes necesidades de accesibilidad a la información, y dentro de un contexto que nos ofrece herramientas para combatir la lucha de la imposibilidad a acceder. En el desarrollo del formato .book se intenta hacer un pequeño esfuerzo para hacer uso de las herramientas ya existentes (dentro del estandar HTML) y así ofrecer compatibilidad con los softwares de asistencia al lector."
                    },{
                        "type": "text",
                        "text": "Esto en palabras menos pretenciosas significa que el documento que usted está leyendo ahora mismo puede (o al menos debería...) poder ser leído sin mayores inconvenientes por un sistema de 'Talkback' convencional."
                    }
                ]
            },{
                "type": "block",
                "title": "Responsividad",
                "components": [
                    {
                        "type": "text",
                        "text": "El documento puede ser leído desde cualquier dispositivo con acceso a un navegador. El documento se adapta a cualquier tipo de pantalla y utiliza un sistema de virtualización de listas que permite mantener una performance aceptable en documentos de cientos de bloques."
                    }
                ]
            }
        ]
    },{
        "type": "block",
        "title": "Componentes",
        "components": [
            {
                "type": "text",
                "text": "En el siguiente bloque, se procederá a explicar y ejemplificar cada uno de los componentes disponibles."
            },{
                "type": "block",
                "title": "Texto",
                "components": [
                    {
                        "type": "text",
                        "text": "Si bien este bloque no requiere mayor explicación, tiene un agregado importante para los profesores de ciencias exactas. Incluye un interprete de latex. Lo cual nos permite escribir R^n \\to R^m y obtener como resultado en el documento <TeX>R^n \\to R^m<TeX>. Entre otras ventajas, esto nos permite poder liberarnos de las formulas como imagenes, las cuales requieren mayor ancho de banda y no pueden ser copiadas directamente. Sin hablar de que estas formulas al igual que el resto del texto, pueden ser leídas por un lector de pantallas."
                    },{
                        "type": "text",
                        "text": "Otro punto importante, esta vez para cualquier area, es que los bloques de texto también interpretan html (con barreras de seguridad para evitar que se pueda ejecutar código malicioso) permitiendo hacer uso de <b> palabras en negrita </b>, <i> cursiva </i>, y <u> subrayado </u>, entre otras cosas."
                    }
                ]
            },{
                "type": "block",
                "title": "Imagen",
                "components": [
                    {
                        "type": "text",
                        "text": "No hay mucho que decir al respecto de las imagenes, y es que a primeras no nos da nada que un pdf no nos pueda dar... salvo tener GIFs!"
                    },{
                       "type": "img",
                       "src": "https://i.ya-webdesign.com/images/carlton-banks-dance-gif-png.gif" 
                    },{
                        "type": "text",
                        "text": "Si bien parezca poco importante, el tener GIFs puede ser una herramienta muy poderosa. Por ejemplo, imaginemos el caso en el que queremos visualizar un campo vectorial en acción. Tenemos dos formas de hacerlo..."
                    },{
                        "type": "img",
                        "src": "https://lh3.googleusercontent.com/proxy/KsWn0AROR2oPW2h4Wvmaq4gXHFwxApPbUYF9PrulOj1zNzx7dCbzBfwrl7L56oaeJOD3nrffv6Z2McNYgzzQ_M73-b5wNCTmJbTBMJxrz_sjUJzXht65tbjt5IqSQC45F8TI2j_CnsJD"
                    },{
                        "type": "img",
                        "src": "https://i.pinimg.com/originals/5b/bf/9d/5bbf9def9550ffa192b11a0d8b9686fd.gif"
                    },{
                        "type": "text",
                        "text": "Como último detalle, las imagenes pueden ser cargadas de manera local o ingresando una url de donde obtener el recurso"
                    }
                ]
            },{
                "type": "block",
                "title": "Lista",
                "components": [
                    {
                        "type": "text",
                        "text": "No hay mucho que decir de las listas salvo lo siguiente:"
                    },{
                        "type": "list",
                        "list": [
                            "Son una buena forma de organizar el texto, y al igual que el resto de los componentes son completamente responsivas.",
                            "Al igual que los bloques de texto podes utilizar LaTeX <TeX>f = \\sqrt{x^2+y^2}<TeX>",
                            "Y <b>también podes</b> <u>usar</u> <i>HTML</i>"
                        ]
                    }
                ]
            },{
                "type": "block",
                "title": "Videos",
                "components": [
                    {
                        "type": "text",
                        "text": "Otro recurso que el formato pone a disposición son los videos. Por ahora los mismo solo pueden ser cargados a partir de un id a un video de youtube."
                    },{
                        "type": "youtube",
                        "id": "spUNpyF58BY"
                    }
                ]
            }
        ]
    },{
        "type": "block",
        "title": "Búsquedas",
        "components": [
            {
                "type": "text",
                "text": "Una parte importante del formato es poder ordenar la información de manera que empodere al lector. Y para poder dotar al estudiante con dicho poder, tenemos que darle herramientas que le permitan encontrar la información entre todos los bloques de datos que se le presentan. Por esto mismo, el lector cuenta con un motor (Que por ahora es bastante básico) encargado de ejecutar consultas y devolver tarjetas rankeadas con el bloque y el extracto de texto al cual adjudica su desición."
            },{
                "type": "text",
                "text": "Para acceder a esta funcionalidad desde la computadora se puede pasar el cursor por la zona izquierda del documento y seleccionar el input que se revela, o apretar 'Ctrl+F'. En el caso del celular se encuentra siempre accesible en la parte superior de la navegación."
            },{
                "type": "text",
                "text": "Por ahora es más un promesa que una realidad, pero ya el hecho de mostrar los resultados ordenados en tarjetas con 'previews' del contenido al que llevan es una gran ventaja respecto de otras formas de búsqueda más tradicional. Como idea general, busco implementar los metodos de búsqueda de google, pero en un documento."
            }
        ]
    }
]